#include "gen_dds.h"
#include "settings.h"
#include "stm32g431xx.h"


void delay_ms( uint32_t a_ms );

// dds генераторы (опорная частота 72000000/512=140625) для TX, компенсации разбаланса и звука

// отсчёты для косинуса, 4096 уровней для ЦАП
static const uint16_t g_cos_table_dac[1024] = {
  2047, 2060, 2073, 2085, 2098, 2110, 2123, 2135
, 2148, 2161, 2173, 2186, 2198, 2211, 2223, 2236
, 2248, 2261, 2273, 2286, 2298, 2311, 2323, 2336
, 2348, 2360, 2373, 2385, 2398, 2410, 2422, 2435
, 2447, 2459, 2472, 2484, 2496, 2508, 2521, 2533
, 2545, 2557, 2569, 2582, 2594, 2606, 2618, 2630
, 2642, 2654, 2666, 2678, 2690, 2702, 2714, 2726
, 2737, 2749, 2761, 2773, 2785, 2796, 2808, 2820
, 2831, 2843, 2854, 2866, 2877, 2889, 2900, 2912
, 2923, 2934, 2946, 2957, 2968, 2980, 2991, 3002
, 3013, 3024, 3035, 3046, 3057, 3068, 3079, 3090
, 3100, 3111, 3122, 3133, 3143, 3154, 3164, 3175
, 3185, 3196, 3206, 3216, 3227, 3237, 3247, 3257
, 3267, 3278, 3288, 3298, 3307, 3317, 3327, 3337
, 3347, 3356, 3366, 3376, 3385, 3395, 3404, 3414
, 3423, 3432, 3441, 3451, 3460, 3469, 3478, 3487
, 3496, 3505, 3513, 3522, 3531, 3539, 3548, 3557
, 3565, 3573, 3582, 3590, 3598, 3606, 3615, 3623
, 3631, 3639, 3646, 3654, 3662, 3670, 3677, 3685
, 3692, 3700, 3707, 3715, 3722, 3729, 3736, 3743
, 3750, 3757, 3764, 3771, 3778, 3784, 3791, 3798
, 3804, 3811, 3817, 3823, 3829, 3836, 3842, 3848
, 3854, 3860, 3865, 3871, 3877, 3882, 3888, 3893
, 3899, 3904, 3909, 3915, 3920, 3925, 3930, 3935
, 3940, 3944, 3949, 3954, 3958, 3963, 3967, 3972
, 3976, 3980, 3984, 3988, 3992, 3996, 4000, 4004
, 4007, 4011, 4014, 4018, 4021, 4025, 4028, 4031
, 4034, 4037, 4040, 4043, 4046, 4048, 4051, 4054
, 4056, 4059, 4061, 4063, 4065, 4067, 4069, 4071
, 4073, 4075, 4077, 4079, 4080, 4082, 4083, 4084
, 4086, 4087, 4088, 4089, 4090, 4091, 4092, 4092
, 4093, 4094, 4094, 4095, 4095, 4095, 4095, 4095
, 4095, 4095, 4095, 4095, 4095, 4095, 4094, 4094
, 4093, 4092, 4092, 4091, 4090, 4089, 4088, 4087
, 4086, 4084, 4083, 4082, 4080, 4079, 4077, 4075
, 4073, 4071, 4069, 4067, 4065, 4063, 4061, 4059
, 4056, 4054, 4051, 4048, 4046, 4043, 4040, 4037
, 4034, 4031, 4028, 4025, 4021, 4018, 4014, 4011
, 4007, 4004, 4000, 3996, 3992, 3988, 3984, 3980
, 3976, 3972, 3967, 3963, 3958, 3954, 3949, 3944
, 3940, 3935, 3930, 3925, 3920, 3915, 3909, 3904
, 3899, 3893, 3888, 3882, 3877, 3871, 3865, 3860
, 3854, 3848, 3842, 3836, 3829, 3823, 3817, 3811
, 3804, 3798, 3791, 3784, 3778, 3771, 3764, 3757
, 3750, 3743, 3736, 3729, 3722, 3715, 3707, 3700
, 3692, 3685, 3677, 3670, 3662, 3654, 3646, 3639
, 3631, 3623, 3615, 3606, 3598, 3590, 3582, 3573
, 3565, 3557, 3548, 3539, 3531, 3522, 3513, 3505
, 3496, 3487, 3478, 3469, 3460, 3451, 3441, 3432
, 3423, 3414, 3404, 3395, 3385, 3376, 3366, 3356
, 3347, 3337, 3327, 3317, 3307, 3298, 3288, 3278
, 3267, 3257, 3247, 3237, 3227, 3216, 3206, 3196
, 3185, 3175, 3164, 3154, 3143, 3133, 3122, 3111
, 3100, 3090, 3079, 3068, 3057, 3046, 3035, 3024
, 3013, 3002, 2991, 2980, 2968, 2957, 2946, 2934
, 2923, 2912, 2900, 2889, 2877, 2866, 2854, 2843
, 2831, 2820, 2808, 2796, 2785, 2773, 2761, 2749
, 2737, 2726, 2714, 2702, 2690, 2678, 2666, 2654
, 2642, 2630, 2618, 2606, 2594, 2582, 2569, 2557
, 2545, 2533, 2521, 2508, 2496, 2484, 2472, 2459
, 2447, 2435, 2422, 2410, 2398, 2385, 2373, 2360
, 2348, 2336, 2323, 2311, 2298, 2286, 2273, 2261
, 2248, 2236, 2223, 2211, 2198, 2186, 2173, 2161
, 2148, 2135, 2123, 2110, 2098, 2085, 2073, 2060
, 2047, 2035, 2022, 2010, 1997, 1985, 1972, 1960
, 1947, 1934, 1922, 1909, 1897, 1884, 1872, 1859
, 1847, 1834, 1822, 1809, 1797, 1784, 1772, 1759
, 1747, 1735, 1722, 1710, 1697, 1685, 1673, 1660
, 1648, 1636, 1623, 1611, 1599, 1587, 1574, 1562
, 1550, 1538, 1526, 1513, 1501, 1489, 1477, 1465
, 1453, 1441, 1429, 1417, 1405, 1393, 1381, 1369
, 1358, 1346, 1334, 1322, 1310, 1299, 1287, 1275
, 1264, 1252, 1241, 1229, 1218, 1206, 1195, 1183
, 1172, 1161, 1149, 1138, 1127, 1115, 1104, 1093
, 1082, 1071, 1060, 1049, 1038, 1027, 1016, 1005
, 995, 984, 973, 962, 952, 941, 931, 920
, 910, 899, 889, 879, 868, 858, 848, 838
, 828, 817, 807, 797, 788, 778, 768, 758
, 748, 739, 729, 719, 710, 700, 691, 681
, 672, 663, 654, 644, 635, 626, 617, 608
, 599, 590, 582, 573, 564, 556, 547, 538
, 530, 522, 513, 505, 497, 489, 480, 472
, 464, 456, 449, 441, 433, 425, 418, 410
, 403, 395, 388, 380, 373, 366, 359, 352
, 345, 338, 331, 324, 317, 311, 304, 297
, 291, 284, 278, 272, 266, 259, 253, 247
, 241, 235, 230, 224, 218, 213, 207, 202
, 196, 191, 186, 180, 175, 170, 165, 160
, 155, 151, 146, 141, 137, 132, 128, 123
, 119, 115, 111, 107, 103, 99, 95, 91
, 88, 84, 81, 77, 74, 70, 67, 64
, 61, 58, 55, 52, 49, 47, 44, 41
, 39, 36, 34, 32, 30, 28, 26, 24
, 22, 20, 18, 16, 15, 13, 12, 11
, 9, 8, 7, 6, 5, 4, 3, 3
, 2, 1, 1, 0, 0, 0, 0, 0
, 0, 0, 0, 0, 0, 0, 1, 1
, 2, 3, 3, 4, 5, 6, 7, 8
, 9, 11, 12, 13, 15, 16, 18, 20
, 22, 24, 26, 28, 30, 32, 34, 36
, 39, 41, 44, 47, 49, 52, 55, 58
, 61, 64, 67, 70, 74, 77, 81, 84
, 88, 91, 95, 99, 103, 107, 111, 115
, 119, 123, 128, 132, 137, 141, 146, 151
, 155, 160, 165, 170, 175, 180, 186, 191
, 196, 202, 207, 213, 218, 224, 230, 235
, 241, 247, 253, 259, 266, 272, 278, 284
, 291, 297, 304, 311, 317, 324, 331, 338
, 345, 352, 359, 366, 373, 380, 388, 395
, 403, 410, 418, 425, 433, 441, 449, 456
, 464, 472, 480, 489, 497, 505, 513, 522
, 530, 538, 547, 556, 564, 573, 582, 590
, 599, 608, 617, 626, 635, 644, 654, 663
, 672, 681, 691, 700, 710, 719, 729, 739
, 748, 758, 768, 778, 788, 797, 807, 817
, 828, 838, 848, 858, 868, 879, 889, 899
, 910, 920, 931, 941, 952, 962, 973, 984
, 995, 1005, 1016, 1027, 1038, 1049, 1060, 1071
, 1082, 1093, 1104, 1115, 1127, 1138, 1149, 1161
, 1172, 1183, 1195, 1206, 1218, 1229, 1241, 1252
, 1264, 1275, 1287, 1299, 1310, 1322, 1334, 1346
, 1358, 1369, 1381, 1393, 1405, 1417, 1429, 1441
, 1453, 1465, 1477, 1489, 1501, 1513, 1526, 1538
, 1550, 1562, 1574, 1587, 1599, 1611, 1623, 1636
, 1648, 1660, 1673, 1685, 1697, 1710, 1722, 1735
, 1747, 1759, 1772, 1784, 1797, 1809, 1822, 1834
, 1847, 1859, 1872, 1884, 1897, 1909, 1922, 1934
, 1947, 1960, 1972, 1985, 1997, 2010, 2022, 2035
};


// ширина импульсов для косинуса, 256 уровней, для ШИМ
static const uint8_t g_cos_table_pwm[1024] = {
128, 129, 130, 130, 131, 132, 133, 133,
134, 135, 136, 137, 137, 138, 139, 140,
140, 141, 142, 143, 144, 144, 145, 146,
147, 147, 148, 149, 150, 151, 151, 152,
153, 154, 154, 155, 156, 157, 157, 158,
159, 160, 160, 161, 162, 163, 164, 164,
165, 166, 167, 167, 168, 169, 169, 170,
171, 172, 172, 173, 174, 175, 175, 176,
177, 178, 178, 179, 180, 180, 181, 182,
183, 183, 184, 185, 185, 186, 187, 187,
188, 189, 189, 190, 191, 192, 192, 193,
194, 194, 195, 196, 196, 197, 198, 198,
199, 199, 200, 201, 201, 202, 203, 203,
204, 205, 205, 206, 206, 207, 208, 208,
209, 209, 210, 211, 211, 212, 212, 213,
214, 214, 215, 215, 216, 216, 217, 218,
218, 219, 219, 220, 220, 221, 221, 222,
222, 223, 224, 224, 225, 225, 226, 226,
227, 227, 228, 228, 229, 229, 229, 230,
230, 231, 231, 232, 232, 233, 233, 234,
234, 234, 235, 235, 236, 236, 237, 237,
237, 238, 238, 239, 239, 239, 240, 240,
240, 241, 241, 242, 242, 242, 243, 243,
243, 244, 244, 244, 245, 245, 245, 245,
246, 246, 246, 247, 247, 247, 248, 248,
248, 248, 249, 249, 249, 249, 250, 250,
250, 250, 250, 251, 251, 251, 251, 251,
252, 252, 252, 252, 252, 253, 253, 253,
253, 253, 253, 253, 254, 254, 254, 254,
254, 254, 254, 254, 255, 255, 255, 255,
255, 255, 255, 255, 255, 255, 255, 255,
255, 255, 255, 255, 255, 255, 255, 255,
255, 255, 255, 255, 255, 255, 255, 255,
255, 255, 255, 255, 255, 255, 255, 255,
255, 255, 255, 255, 255, 254, 254, 254,
254, 254, 254, 254, 254, 253, 253, 253,
253, 253, 253, 253, 252, 252, 252, 252,
252, 251, 251, 251, 251, 251, 250, 250,
250, 250, 250, 249, 249, 249, 249, 248,
248, 248, 248, 247, 247, 247, 246, 246,
246, 245, 245, 245, 245, 244, 244, 244,
243, 243, 243, 242, 242, 242, 241, 241,
240, 240, 240, 239, 239, 239, 238, 238,
237, 237, 237, 236, 236, 235, 235, 234,
234, 234, 233, 233, 232, 232, 231, 231,
230, 230, 229, 229, 229, 228, 228, 227,
227, 226, 226, 225, 225, 224, 224, 223,
222, 222, 221, 221, 220, 220, 219, 219,
218, 218, 217, 216, 216, 215, 215, 214,
214, 213, 212, 212, 211, 211, 210, 209,
209, 208, 208, 207, 206, 206, 205, 205,
204, 203, 203, 202, 201, 201, 200, 199,
199, 198, 198, 197, 196, 196, 195, 194,
194, 193, 192, 192, 191, 190, 189, 189,
188, 187, 187, 186, 185, 185, 184, 183,
183, 182, 181, 180, 180, 179, 178, 178,
177, 176, 175, 175, 174, 173, 172, 172,
171, 170, 169, 169, 168, 167, 166, 166,
165, 164, 164, 163, 162, 161, 160, 160,
159, 158, 157, 157, 156, 155, 154, 154,
153, 152, 151, 151, 150, 149, 148, 147,
147, 146, 145, 144, 144, 143, 142, 141,
140, 140, 139, 138, 137, 137, 136, 135,
134, 133, 133, 132, 131, 130, 130, 129,
128, 127, 126, 126, 125, 124, 123, 123,
122, 121, 120, 119, 119, 118, 117, 116,
115, 115, 114, 113, 112, 112, 111, 110,
109, 109, 108, 107, 106, 105, 105, 104,
103, 102, 102, 101, 100, 99, 99, 98,
97, 96, 95, 95, 94, 93, 92, 92,
91, 90, 89, 89, 88, 87, 87, 86,
85, 84, 84, 83, 82, 81, 81, 80,
79, 78, 78, 77, 76, 76, 75, 74,
73, 73, 72, 71, 71, 70, 69, 69,
68, 67, 67, 66, 65, 64, 64, 63,
62, 62, 61, 60, 60, 59, 58, 58,
57, 57, 56, 55, 55, 54, 53, 53,
52, 51, 51, 50, 50, 49, 48, 48,
47, 46, 46, 45, 45, 44, 44, 43,
42, 42, 41, 41, 40, 40, 39, 38,
38, 37, 37, 36, 36, 35, 35, 34,
34, 33, 32, 32, 31, 31, 30, 30,
29, 29, 28, 28, 27, 27, 27, 26,
26, 25, 25, 24, 24, 23, 23, 22,
22, 22, 21, 21, 20, 20, 19, 19,
19, 18, 18, 17, 17, 17, 16, 16,
16, 15, 15, 14, 14, 14, 13, 13,
13, 12, 12, 12, 11, 11, 11, 11,
10, 10, 10, 9, 9, 9, 8, 8,
8, 8, 7, 7, 7, 7, 6, 6,
6, 6, 6, 5, 5, 5, 5, 5,
4, 4, 4, 4, 4, 3, 3, 3,
3, 3, 3, 3, 2, 2, 2, 2,
2, 2, 2, 2, 1, 1, 1, 1,
1, 1, 1, 1, 1, 1, 1, 1,
1, 1, 1, 1, 1, 1, 1, 1,
1, 1, 1, 1, 1, 1, 1, 1,
1, 1, 1, 1, 1, 1, 1, 1,
1, 1, 1, 1, 1, 2, 2, 2,
2, 2, 2, 2, 2, 3, 3, 3,
3, 3, 3, 3, 4, 4, 4, 4,
4, 5, 5, 5, 5, 5, 6, 6,
6, 6, 6, 7, 7, 7, 7, 8,
8, 8, 8, 9, 9, 9, 10, 10,
10, 11, 11, 11, 11, 12, 12, 12,
13, 13, 13, 14, 14, 14, 15, 15,
16, 16, 16, 17, 17, 17, 18, 18,
19, 19, 19, 20, 20, 21, 21, 22,
22, 22, 23, 23, 24, 24, 25, 25,
26, 26, 27, 27, 27, 28, 28, 29,
29, 30, 30, 31, 31, 32, 32, 33,
34, 34, 35, 35, 36, 36, 37, 37,
38, 38, 39, 40, 40, 41, 41, 42,
42, 43, 44, 44, 45, 45, 46, 47,
47, 48, 48, 49, 50, 50, 51, 51,
52, 53, 53, 54, 55, 55, 56, 57,
57, 58, 58, 59, 60, 60, 61, 62,
62, 63, 64, 64, 65, 66, 67, 67,
68, 69, 69, 70, 71, 71, 72, 73,
74, 74, 75, 76, 76, 77, 78, 79,
79, 80, 81, 81, 82, 83, 84, 84,
85, 86, 87, 87, 88, 89, 90, 90,
91, 92, 93, 93, 94, 95, 96, 96,
97, 98, 99, 99, 100, 101, 102, 102,
103, 104, 105, 105, 106, 107, 108, 109,
109, 110, 111, 112, 112, 113, 114, 115,
116, 116, 117, 118, 119, 119, 120, 121,
122, 123, 123, 124, 125, 126, 126, 127
};

// текущая фаза генератора TX
static uint32_t g_phase_tx = 0;
// текущая фаза генератора компенсации разбаланса
static volatile uint32_t g_phase_comp = 0;
// текущая фаза генератора звука
static uint32_t g_phase_sound = 0;
// уровень выходного сигнала TX [0..256]
static volatile uint32_t g_level_tx = 0;
// смещение для центрирования сигнала в диапазоне значений для ЦАП
// т.к. используется буферный ОУ, который не может работать от нуля
static uint32_t g_dac_offset_tx = 0;
// уровень выходного сигнала компенсации разбаланса [0..256]
static volatile uint32_t g_level_comp = 0;
static uint32_t g_dac_offset_comp = 0;
// уровень громкости звука [0...256]
static volatile uint32_t g_level_sound = 0;
// частота (сдвиг фазы генератора) TX и сигнала компенсации
static uint32_t g_gen_freq = 0;
// частота (сдвиг фазы генератора) звука
static uint32_t g_sound_freq = 0;


uint32_t get_tx_phase() {
  return g_phase_tx;
}


uint32_t get_tx_freq() {
  return g_gen_freq;
}


void set_sound_freq_by_angle( uint32_t a_angle ) {
  g_sound_freq = 512u + (uint32_t)( ((((uint64_t)a_angle) * 10) << 32) / BASE_PWM_FREQ );
}


uint32_t get_tx_level() {
  return g_level_tx;
}


uint32_t get_cm_level() {
  return g_level_comp;
}


void set_tx_level( uint32_t a_level ) {
  if ( a_level > MAX_TX_LEVEL ) {
    a_level = MAX_TX_LEVEL;
  } else {
    if ( a_level < MIN_TX_LEVEL ) {
      a_level = MIN_TX_LEVEL;
    }
  }
  g_level_tx = a_level;
  g_dac_offset_tx = (DAC_FULL_SCALE - a_level) / 2;
}


void set_cm_level( uint32_t a_level ) {
  if ( a_level > MAX_TX_LEVEL ) {
    a_level = MAX_TX_LEVEL;
  } else {
    if ( a_level < MIN_TX_LEVEL ) {
      a_level = MIN_TX_LEVEL;
    }
  }
  g_level_comp = a_level;
  g_dac_offset_comp = (DAC_FULL_SCALE - a_level) / 2u;
}


// установить громкость звука
void set_sound_volume( uint32_t a_volume ) {
  if ( a_volume > MAX_SOUND_VOLUME ) {
    a_volume = MAX_SOUND_VOLUME;
  } else {
    if ( a_volume < MIN_SOUND_VOLUME ) {
      a_volume = MIN_SOUND_VOLUME;
    }
  }
  g_level_sound = a_volume;
}


// изменить текущую фазу сигнала компенсации
void set_cm_phase( uint32_t a_phase_diff ) {
  // запоминаем текущую фазу генератора
  uint32_t v_phase = g_phase_comp;
  // ждём изменения фазы генератора (сгенерирован очередной отсчёт)
  while ( v_phase == g_phase_comp ) {}
  // меняем фазу генератора между отсчётами
  g_phase_comp += a_phase_diff;
}


// настройка таймера-1
// канал 1 - генерация "синуса" для звука
// настройка таймера-2 - генерация "пинков" для ЦАП (cобытие сравнения 1 раз за период частоты 140625)
// настройка таймера-3 - генерация "пинков" для АЦП (cобытие сравнения 2 раза за период частоты 140625)
// настройка ЦАП
void gen_dds_startup() {
  // настройки генераторов из профиля
  settings_t * v_profile = settings_get_current_profile();
  g_level_tx = v_profile->level_tx; // по базовой схеме ~60 мА
  g_dac_offset_tx = (DAC_FULL_SCALE - g_level_tx) / 2u;
  g_level_comp = v_profile->level_comp;
  g_dac_offset_comp = (DAC_FULL_SCALE - g_level_comp) / 2u;
  g_level_sound = v_profile->level_sound;
  g_gen_freq = v_profile->gen_freq;
  g_phase_comp = v_profile->phase_comp_start;
  // настраиваем таймер-1
  // тактируется от APB2 c множителем 2 (т.к. для APB2 установлен делитель на 2) - 144 МГц
  // ставим предделитель 2, так что таймер в итоге тактируется частотой 72 МГц
  // AHB/2*2/2 = 144/2*2/2 = 72 МГц
  // двунаправленный счётчик, APR=256, период 512 такта
  // ШИМ 8 битов (частота 72000000 / 512 = 140625). Update Event один раз за период, т.е. RCR=1
  // Output Trigger по включению таймера для одновременного запуска TIM2 и TIM3
  TIM1->PSC = 1; // делим на два
  TIM1->ARR = 256; // докуда считать
  TIM1->RCR = 1; // "делитель" частоты Update Event
  TIM1->CNT = 0; // на всяк случ сброс счётчика
  TIM1->CCR1 = g_cos_table_pwm[0]; // звук начинаем с нулевой фазы
  // сигнал компенсации по фазе от g_phase_comp, может быть прочитано из профиля и != 0
  // 1024 отсчёта - период "синусоиды", 2^32 - период фазы генератора (DDS)
  // TIM1->CCR2 = g_cos_table[g_phase_comp >> 22];
  // TIM1->CCR3 = g_cos_table[0]; // звук, с нулевой фазы, тут пофик
  // режимы сравнения для одного канала
  TIM1->CCMR1 = TIM_CCMR1_OC1M_1
              | TIM_CCMR1_OC1M_2
              | TIM_CCMR1_OC1PE
              ;
  TIM1->CCER = TIM_CCER_CC1E;
  TIM1->BDTR = TIM_BDTR_MOE
             | TIM_BDTR_OSSR
             ;
  TIM1->CR2 = TIM_CR2_MMS_0; // запуск таймера - событие TRGO
  TIM1->CR1 = TIM_CR1_CMS_0 | TIM_CR1_CMS_1
            | TIM_CR1_URS
            ;
  TIM1->SR = 0;
  TIM1->DIER = TIM_DIER_UIE;
  // настраиваем таймер-2 для пинания ЦАП, тактирование 36 МГц (APB1*2/4)
  // счёт вверх до 255 (0..255, 256 тактов), запуск синхронно со стартом TIM1
  // частота пинков 36000000/256=140625
  TIM2->PSC = 3; // делитель на 4
  TIM2->CR1 = TIM_CR1_URS;
  TIM2->CR2 = TIM_CR2_MMS_1;
  TIM2->ARR = 255;
  TIM2->CNT = 0;
  TIM2->SMCR = TIM_SMCR_SMS_1
             | TIM_SMCR_SMS_2
             ;
  // настраиваем таймер-3 для пинания АЦП, тактирование 36 МГц (APB1*2/4)
  // счёт вверх до 127 (0..127, 128 тактов), запуск синхронно со стартом TIM1
  // частота пинков 36000000/128=281250
  TIM3->PSC = 3; // делитель на 4
  TIM3->CR1 = TIM_CR1_URS;
  TIM3->CR2 = TIM_CR2_MMS_1;
  TIM3->ARR = 127;
  TIM3->CNT = 0;
  TIM3->SMCR = TIM_SMCR_SMS_1
             | TIM_SMCR_SMS_2
             ;
  // ЦАП1
  DAC1->MCR = DAC_MCR_HFSEL_0;
  DAC1->CR = DAC_CR_TSEL2_2  // dac_ch2_trg4 (TIM2_TRGO)
           | DAC_CR_TEN2
           | DAC_CR_EN2
           | DAC_CR_TSEL1_2  // dac_ch1_trg4 (TIM2_TRGO)
           | DAC_CR_TEN1
           | DAC_CR_EN1
           ;
  // запускаем TIM1, TIM2 и TIM3
  TIM1->CR1 |= TIM_CR1_CEN;
  __NVIC_EnableIRQ( TIM1_UP_TIM16_IRQn );
  // генерируем Update Event, чтобы в "теневые" регистры попали текущие значения
  // а в буферные регистры легли новые значения (для следующего периода)
  // TIM1->EGR = TIM_EGR_UG;
}


void gen_dds_init() {
  // включаем тактирование таймеров 1..3 и ЦАП1
  RCC->APB2ENR |= RCC_APB2ENR_TIM1EN;
  RCC->APB1ENR1 |= (RCC_APB1ENR1_TIM2EN | RCC_APB1ENR1_TIM3EN);
  RCC->AHB2ENR |= RCC_AHB2ENR_DAC1EN;
  // включаем выход канала CH1/PA8 (AF6)
  // alternate push-pull low speed
  GPIOA->AFR[1] = (GPIOA->AFR[1] & ~GPIO_AFRH_AFSEL8)
                | (6 << GPIO_AFRH_AFSEL8_Pos)
                ;
  GPIOA->OTYPER = (GPIOA->OTYPER & ~GPIO_OTYPER_OT8);
  GPIOA->OSPEEDR = (GPIOA->OSPEEDR & ~GPIO_OSPEEDR_OSPEED8);
  GPIOA->MODER = (GPIOA->MODER & ~GPIO_MODER_MODE8)
               | GPIO_MODER_MODE8_1
               ;
  // ЦАП1
  GPIOA->MODER |= (GPIO_MODER_MODE4 | GPIO_MODER_MODE5);
  //
  gen_dds_startup();
}


void gen_dds_shutdown() {
  // отключаем прерывание от таймера
  __NVIC_DisableIRQ( TIM1_UP_TIM16_IRQn );
  // отключаем таймер 3
  TIM3->CR1 = 0;
  // отключаем таймер 2
  TIM2->CR1 = 0;
  // отключаем таймер 1
  TIM1->CR1 = 0;
  // сброс таймеров 1, 2 и 3
  RCC->APB1RSTR1 = RCC_APB1RSTR1_TIM2RST | RCC_APB1RSTR1_TIM3RST;
  RCC->APB2RSTR = RCC_APB2RSTR_TIM1RST;
  delay_ms( 2u );
  RCC->APB1RSTR1 = 0;
  RCC->APB2RSTR = 0;
  // начальные значения переменных
  g_phase_tx = 0;
  g_phase_comp = 0;
  g_phase_sound = 0;
  g_level_tx = 0;
  g_dac_offset_tx = DAC_FULL_SCALE / 2u;
  g_level_comp = 0;
  g_dac_offset_comp = DAC_FULL_SCALE / 2u;
  g_level_sound = 0;
  g_gen_freq = 0;
  g_sound_freq = 0;
}


// событие update таймера-1, обновляем регистр сравнения и значения для ЦАП
// эти значения перепишутся в "теневые" регистры при следующем Update Event
void ih_TIM1_UP_TIM16_IRQ() {
  // подвинем фазу
  g_phase_tx += g_gen_freq;
  // значение косинуса берём из таблицы
  uint32_t v_dac = g_dac_offset_tx + ((g_cos_table_dac[g_phase_tx >> 22] * g_level_tx) >> 12);
  // подвинем фазу
  g_phase_comp += g_gen_freq;
  // значение косинуса из таблицы
  v_dac |= (g_dac_offset_comp + ((g_cos_table_dac[g_phase_comp >> 22] * g_level_comp) >> 12)) << 16;
  DAC1->DHR12RD = v_dac;
  // подвинем фазу
  g_phase_sound += g_sound_freq;
  // значение косинуса из таблицы
  TIM1->CCR1 = (g_cos_table_pwm[g_phase_sound >> 22] * g_level_sound) >> 12;
  // сбрасываем флаги прерывания
  TIM1->SR = 0;
}
